DELETE FROM meresek;
DELETE FROM szemelyek;
DELETE FROM kartya;

INSERT INTO kartya (`UID`, `kartyaTipus`) VALUES
('04A1B2C3D4', 'tanulói'),
('0456AB89EF', 'tanulói'),
('045533AA12', 'tanulói'),
('0444BC6721', 'tanulói'),
('0412DD9833', 'tanulói'),
('0488ACFF22', 'tanulói'),
('04CAF31289', 'tanulói'),
('0466BBA120', 'tanulói'),
('0477CC8934', 'tanulói'),
('04DDAA7611', 'tanulói');

INSERT INTO szemelyek (`OM`, `nev`, `lakcim`, `TAJ`, `nem`, `szuletesiDatum`, `osztaly`, `kartya`) VALUES
(NULL, 'Kiss Péter', 'Kecskemét, Fő utca 1.', '123456789', 'férfi', '2007-04-12 00:00:00', 11, '04A1B2C3D4'),
(NULL, 'Nagy Anna', 'Kiskunfélegyháza, Dózsa tér 5.', '987654321', 'nő', '2008-01-22 00:00:00', 10, '0456AB89EF'),
(NULL, 'Tóth Márk', 'Kecel, Petőfi u. 11.', '456789123', 'férfi', '2007-08-15 00:00:00', 11, '045533AA12'),
(NULL, 'Horváth Lili', 'Kiskőrös, Széchenyi tér 3.', '741852963', 'nő', '2009-02-10 00:00:00', 9, '0444BC6721'),
(NULL, 'Szabó Dávid', 'Orgovány, Rákóczi u. 20.', '159753486', 'férfi', '2006-12-01 00:00:00', 12, '0412DD9833'),
(NULL, 'Varga Nóra', 'Kerekegyháza, Kossuth u. 14.', '852456123', 'nő', '2007-05-18 00:00:00', 11, '0488ACFF22'),
(NULL, 'Balogh Richárd', 'Lajosmizse, Tanya 33.', '951847263', 'férfi', '2008-09-09 00:00:00', 10, '04CAF31289'),
(NULL, 'Fekete Zsófia', 'Izsák, Béke u. 2.', '357159486', 'nő', '2007-07-27 00:00:00', 11, '0466BBA120'),
(NULL, 'Molnár Bence', 'Kiskunhalas, Kőrösi út 7.', '258369147', 'férfi', '2009-11-05 00:00:00', 9, '0477CC8934'),
(NULL, 'Lakatos Emese', 'Kiskőrös, Szent István u. 6.', '654987321', 'nő', '2008-03-14 00:00:00', 10, '04DDAA7611');

INSERT INTO meresek (`szemely`, `testzsir%`, `magassag`, `suly`, `datum`) VALUES
-- 1 mérés (4 fő)
(5,18,178,74,'2024-10-01 00:00:00'),
(6,25,165,63,'2024-10-02 00:00:00'),
(9,16,170,58,'2024-09-15 00:00:00'),
(10,28,160,70,'2024-09-20 00:00:00'),

-- 2 mérés (3 fő)
(1,20,175,72,'2024-09-01 00:00:00'),
(1,19,176,73,'2024-10-01 00:00:00'),

(2,24,168,62,'2024-09-05 00:00:00'),
(2,23,168,61,'2024-10-05 00:00:00'),

(3,21,182,80,'2024-09-10 00:00:00'),
(3,22,182,81,'2024-10-10 00:00:00'),

-- 3 mérés (3 fő)
(4,26,162,55,'2024-09-01 00:00:00'),
(4,25,162,56,'2024-09-20 00:00:00'),
(4,24,162,55,'2024-10-10 00:00:00'),

(7,19,180,85,'2024-08-15 00:00:00'),
(7,18,180,84,'2024-09-15 00:00:00'),
(7,17,180,83,'2024-10-15 00:00:00'),

(8,27,167,72,'2024-07-01 00:00:00'),
(8,26,167,71,'2024-08-01 00:00:00'),
(8,25,167,70,'2024-09-01 00:00:00'),

-- 4 mérés (1 fő)
(6,23,165,62,'2024-06-01 00:00:00'),
(6,22,165,61,'2024-07-01 00:00:00'),
(6,21,165,60,'2024-08-01 00:00:00'),
(6,20,165,59,'2024-09-01 00:00:00');
